cats_99/app/controllers/cats_controller.rb

UPDATE "cats" SET "name" = $1, "birth_date" = $2, "color" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["name", "Jalks_to"], ["birth_date", "2019-04-01"], ["color", "Orange"], ["sex", "M"], ["description", " asd     "], ["updated_at", "2019-04-03 00:19:24.088746"], ["id", 5]]
---
    def update
        @cat = Cat.update(cat_params)